In [2]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

In [5]:
##
## Crea un DataFrame a partir del archivo fligths.csv
##
flights = pd.read_csv(
    "https://raw.githubusercontent.com/jdvelasq/playground/master/datasets/flights.csv",
    sep = ',',         # separador de campos
    thousands = None,  # separador de miles para números
    decimal = '.')     # separador de los decimales para números

# SELECT

In [ ]:
df[["total_bill", "tip", "smoker", "time"]].hedad(5)

In [ ]:
%%R -i df
df %>% select(total_bill, tip , smoker, time) %>% head(5)

# Where

In [ ]:
##
##  SELECT
##      *
##  FROM
##      df
##  WHERE
##      time = 'Dinner'
##  LIMIT 5;
##

df[df["time"] == "Dinner"].head(5)

In [ ]:
%%R
df %>% filter(time == 'Dinner') %>% head(5)

In [ ]:
is_dinner = df["time"] == "Dinner"
is_dinner.value_counts()

In [ ]:
df[is_dinner].head(5)

In [ ]:
##
##  SELECT
##      *
##  FROM
##      df
##  WHERE
##      time = 'Dinner' AND tip > 5.00;
##

df[(df["time"] == "Dinner") & (df["tip"] > 5.00)]

In [ ]:
%%R
df %>% filter(time == 'Dinner', tip > 5.00 )

In [ ]:
%%R
df %>% filter(time == 'Dinner' & tip > 5.00 )

In [ ]:
##
##  SELECT
##      *
##  FROM
##      df
##  WHERE
##      size >= 5 OR total_bill > 45;
##
df[(df['size'] >= 5) | (df['total_bill'] > 45)]

In [ ]:
%%R
df %>% filter(size >= 5 | total_bill > 45)

In [ ]:
##
##  SELECT
##      sex,
##      count(*)
##  FROM
##      df
##  GROUP BY
##      sex;
##
df.groupby('sex').size()

In [ ]:
%%R
df %>% group_by(sex) %>% summarize(n())

In [ ]:
df.groupby('sex').count()

In [ ]:
df.groupby('sex')['total_bill'].count()

In [ ]:
##
##  SELECT
##      day,
##      AVG(tip),
##      COUNT(*)
##  FROM
##      df
##  GROUP BY
##      day;
##
df.groupby('day').agg({'tip': np.mean, 'day': np.size})

In [ ]:
%%R
df %>% group_by(day) %>% summarize(mean_tip=mean(tip), n_day=n())

In [ ]:
##
##  SELECT
##      smoker,
##      day,
##      COUNT(*),
##      AVG(tip)
##  FROM
##      df
##  GROUP BY
##      smoker,
##      day;
##
df.groupby(['smoker', 'day']).agg({'tip': [np.size, np.mean]})

In [ ]:
%%R
df %>% group_by(smoker, day) %>% summarize(mean(tip), n())

# Join

In [6]:
df1 = pd.DataFrame({
    'key': ['A', 'B', 'C', 'D'],
    'value': np.random.randn(4)})

df2 = pd.DataFrame({
    'key': ['B', 'D', 'D', 'E'],
    'value': np.random.randn(4)})

# Inner Join

In [7]:
##
##  SELECT
##      *
##  FROM
##      df1
##  INNER JOIN
##      df2
##    ON df1.key = df2.key;
##
pd.merge(df1, df2, on="key")

  key   value_x   value_y
0   B -1.899224 -0.011079
1   D  0.135052 -0.062089
2   D  0.135052  1.996956

## Left outer join

In [8]:
##
##  SELECT
##      *
##  FROM
##      df1
##  LEFT OUTER JOIN
##       df2
##    ON
##       df1.key = df2.key;
##
pd.merge(df1, df2, on="key", how="left")

  key   value_x   value_y
0   A  1.271664       NaN
1   B -1.899224 -0.011079
2   C  1.476130       NaN
3   D  0.135052 -0.062089
4   D  0.135052  1.996956

## Right Join

In [9]:
##
##  SELECT
##      *
##  FROM
##      df1
##  RIGHT OUTER JOIN
##      df2
##  ON
##      df1.key = df2.key;
##
pd.merge(df1, df2, on="key", how="right")

  key   value_x   value_y
0   B -1.899224 -0.011079
1   D  0.135052 -0.062089
2   D  0.135052  1.996956
3   E       NaN  0.723553

## Full Join

In [10]:
##
##  SELECT
##      *
##  FROM
##      df1
##  FULL OUTER JOIN
##       df2
##    ON
##       df1.key = df2.key;
##
pd.merge(df1, df2, on="key", how="outer")

  key   value_x   value_y
0   A  1.271664       NaN
1   B -1.899224 -0.011079
2   C  1.476130       NaN
3   D  0.135052 -0.062089
4   D  0.135052  1.996956
5   E       NaN  0.723553

# Union

In [11]:
df1 = pd.DataFrame({
    'city': ['Chicago', 'San Francisco', 'New York City'],
    'rank': range(1, 4)})

df2 = pd.DataFrame({
    'city': ['Chicago', 'Boston', 'Los Angeles'],
    'rank': [1, 4, 5]})

In [13]:
##  SELECT city, rank
##  FROM df1
##  UNION ALL
##  SELECT city, rank
##  FROM df2;
##

pd.concat([df1, df2])

            city  rank
0        Chicago     1
1  San Francisco     2
2  New York City     3
0        Chicago     1
1         Boston     4
2    Los Angeles     5

In [14]:
##
##  SELECT
##      city,
##     rank
##  FROM
##      df1
##  UNION
##      SELECT
##          city,
##          rank
##      FROM
##          df2
##
pd.concat([df1, df2]).drop_duplicatesplicates()

            city  rank
0        Chicago     1
1  San Francisco     2
2  New York City     3
1         Boston     4
2    Los Angeles     5

## Funciones analíticas y de agregacion

## Top N rows with offset

In [15]:
##
##  SELECT
##      *
##  FROM
##      df
##  ORDER BY
##      tip DESC
##  LIMIT 10 OFFSET 5;
##
df.nlargest(10 + 5, columns="tip").tail(10)

NameError: name 'df' is not defined

In [ ]:
%%R
df %>% arrange(desc(tip)) %>% head(15) %>% tail(10)

## Top N rows per group

In [ ]:
##
##  SELECT * FROM (
##    SELECT
##      t.*,
##      ROW_NUMBER() OVER(PARTITION BY day ORDER BY total_bill DESC) AS rn
##    FROM df t
##  )
##  WHERE rn < 3
##  ORDER BY day, rn;
##

(df.assign(rn=df.sort_values(['total_bill'], ascending=False)
             .groupby(['day'])
             .cumcount() + 1)
 .query('rn < 3')
 .sort_values(['day', 'rn']))

In [18]:
df1.assign?

In [ ]:
%%R
df  %>% group_by(day) %>% arrange(desc(total_bill)) %>% mutate(rn=1:n()) %>% filter(rn < 3) %>% arrange(day, rn)

In [ ]:
(df.assign(rnk=df.groupby(['day'])['total_bill']
             .rank(method='first', ascending=False))
 .query('rnk < 3')
 .sort_values(['day', 'rnk']))

In [ ]:
##
##  SELECT * FROM (
##    SELECT
##      t.*,
##      RANK() OVER(PARTITION BY sex ORDER BY tip) AS rnk
##    FROM df t
##    WHERE tip < 2
##  )
##  WHERE rnk < 3
##  ORDER BY sex, rnk;
##
(df[df['tip'] < 2]
 .assign(rnk_min=df.groupby(['sex'])['tip']
         .rank(method='min'))
 .query('rnk_min < 3')
 .sort_values(['sex', 'rnk_min']))

In [ ]:
%%R
df %>% filter(tip < 2) %>% group_by(sex) %>% arrange(tip) %>% mutate(rnk_min=1:n()) %>% filter(rnk_min < 3) %>% arrange(sex, rnk_min)

## Update

In [ ]:
##
##  UPDATE
##      df
##  SET
##      tip = tip*2
##  WHERE
##      tip < 2;
##
df.loc[df['tip'] < 2, 'tip'] *= 2
df.head()

## Delete

In [ ]:
##
##  DELETE FROM
##      tips
##  WHERE
##      tip > 9;
##
df.loc[df["tip"] <= 9].head(10)